## Target Guided Ordinal Encoding
It is a technique used to encode categorical variables based on their relationships with the target variables. This encoding technique is useful when we have a categorical variable with a large number of unique categories, and we want to use this variable as a feature in our machine learning model.
In Target guided Ordinal Encoduing, we replace each category in the categorical variable with a numerical value based on its mean and median of the target variable for that category. This creates a monotonic relationship between the categorical variable and the target variable, which can be useful for some machine learning algorithms.

In [2]:
import pandas as pd
df = pd.DataFrame({
    'city':['New York', 'London', 'Paris', 'Tokyo', "New York", 'Paris'],
    'price':[200, 150, 300, 400, 250,800]
})

In [3]:
df

       city  price
0  New York    200
1    London    150
2     Paris    300
3     Tokyo    400
4  New York    250
5     Paris    800

In [5]:
mean_price = df.groupby('city')['price'].mean().to_dict()

In [6]:
mean_price

{'London': 150.0, 'New York': 225.0, 'Paris': 550.0, 'Tokyo': 400.0}

In [7]:
df['city_encoder'] = df['city'].map(mean_price)

In [8]:
df

       city  price  city_encoder
0  New York    200         225.0
1    London    150         150.0
2     Paris    300         550.0
3     Tokyo    400         400.0
4  New York    250         225.0
5     Paris    800         550.0

In [11]:
df[['price','city_encoder']]

   price  city_encoder
0    200         225.0
1    150         150.0
2    300         550.0
3    400         400.0
4    250         225.0
5    800         550.0